function [result,violent,n,discharge,Em,Es]= target_maxf(x,r)
%四水电站混联 联合调度目标函数与罚函数
%默认x向量的编码方式为：
%x(j)代表库容 其中4个电站一个时间段为一个单元 共12个单元 48个元素 一行排列
%函数返回三个数据分别为 目标函数值result 约束违反程度violent 与弃水量discharge
%-----------------------------------
%--------基本数据------------------
%%%%%%%%%%%%%%%%% 每月来水量，丰水年情况
lize_month=[7.45161290322581,6.38709677419355,7.41935483870968,...
    13.4193548387097,23.7419354838710,31.3225806451613,...
    60.0000000000000,50.9677419354839,59.3548387096774,...
    34.5161290322581,17.2258064516129,9.77419354838710];%利泽月来水量
weituo_month=[3.96774193548387,3.32258064516129,3.51612903225807,...
    6.41935483870968,12.4838709677419,17.5483870967742,...
    45.8387096774194,43.0000000000000,37.9677419354839,...
    18.2903225806452,9.61290322580645,5.54838709677419];%渭沱月来水量
luoduxi_month=[73.8580645161291,78.2322580645161,108.719354838710,...
    145.135483870968,323.912903225806,1119.05161290323,...
    1065.83870967742,2140.51612903226,3556.06451612903,...
    714.161290322581,1340.83870967742,303.761290322581];%罗渡溪月来水量
%%%%%%%%%%%%每月秒数
t=31*24*60*60;
% 各电站最大发电引用流量
qm1=2*200;    % 渭沱两台机组
qm2=4*388.9;  % 利泽4台机组
qm3=4*698;    % 草街4台机组
qm4=6*500;    % 井口4台机组
% 边界条件水库初始库容
v01=1650e4;
v02=5773e4;
v03=74667e4;
v04=14952e4;
%-------------------------------------------------
z=zeros(size(x));     % 记录库容对应的水位
discharge=z;          % 记录个水库的弃水量
q=z;                  % 记录水库发电引用流量
h=z;                  % 记录上下游水位差
H=z;                  % 记录水轮机水头
Em=zeros(1,12);       % 记录月总发电量
Es=z;                 %记录各电站每月发电量
     for j=1:4:48        %%%%%%% 库容推求水位 利用cubic curve fitting
         %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 渭沱上游水位对应的库容
         z(j)=0.0018305874521551467135754842630035*x(j)/1e4+...
                202.48285904476608720869990065694;   
      
          %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 利泽上游对应的水位 
         z(j+1)=0.1988639984e-2*x(j+1)/1e4-0.6896937851e-7*(x(j+1)/1e4)^2+...
         0.2023282902e3+0.9590483713e-12*(x(j+1)/1e4)^3;                   
       
         %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 草街上游对应水位  
         z(j+2)=0.3362104882e1*(x(j+2)/1e4)^3/0.1000000000000000e16+(-0.1e1)*...
                0.1890378905e1*(x(j+2)/1e4)^2/0.1000000000e10+0.4154782216e-3*...
                (x(j+2)/1e4)+ 0.1819231930e3;                 
         %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 井口上游对应的水位
         z(j+3)=0.6152201768e1*(x(j+3)/1e4)^3/0.1000000000000000e16+(-0.1e1)*...
                0.2928489463e1*(x(j+3)/1e4)^2/0.1000000000e10+0.5667546633e-3*...
                (x(j+3)/1e4)+0.1696579477e3;                  
     end
     %%%%%%%%%%%%%%%%%%%%%%%%%% 计算弃水量
     %计算第一个月的
     discharge(1)=((v01 - x(1)) / t + weituo_month(1)-qm1)*t;
     if discharge(1)<0
         discharge(1)=0;
     end
     discharge(2)=((v02-x(2)) / t + lize_month(1)-qm2)*t;
     if discharge(2)<0
         discharge(2)=0;
     end
     discharge(3)=((v03 - x(3) + v01 - x(1) + weituo_month(1) *...
         t + v02 - x(2) + lize_month(1) * t + luoduxi_month(1) * t)-qm3*t);
     if discharge(3)<0
         discharge(3)=0;
     end
     discharge(4)=((v04 - x(4) + v03 - x(3) + v01 - x(1) + weituo_month(1)...
         * t + v02 - x(2) + lize_month(1) * t + luoduxi_month(1) * t)-qm4*t);
     if discharge(4)<0
         discharge(4)=0;
     end
     %计算2到12月
     for j=5:4:48
          discharge(j)=((x(j-4) - x(j)) / t + weituo_month((j-1)/4+1)-qm1)*t;
          if discharge(j)<0
                discharge(j)=0;                   % 渭沱弃水量
          end
         discharge(j+1)=((x(j-3)-x(j+1)) / t + lize_month((j-1)/4+1)-qm2)*t;
            if discharge(j+1)<0
                 discharge(j+1)=0;                % 利泽弃水量
            end
         discharge(j+2)=((x(j-2) - x(j+2) + x(j-4) - x(j) + weituo_month((j-1)/4+1) *...
         t + x(j-3) - x(j+1) + lize_month((j-1)/4+1) * t + luoduxi_month((j-1)/4+1) * t)-qm3*t);
         if discharge(j+2)<0
                discharge(j+2)=0;                 % 草街弃水量
         end
         discharge(j+3)=((x(j-1) - x(j+3) + x(j-2) - x(j+2) + x(j-4) - x(j) + weituo_month((j-1)/4+1)...
         * t + x(j-3) - x(j+1) + lize_month((j-1)/4+1) * t + luoduxi_month((j-1)/4+1) * t)-qm4*t);
         if discharge(j+3)<0
               discharge(j+3)=0;                  % 井口弃水量
         end
     end
     %%%%%%%%%%%%%%%%%%%%%%%%%% 发电引用流量计算
     %计算第一个月的
     q(1)=(v01-x(1)-discharge(1))/t+weituo_month(1);
     if q(1)<0
         q(1)=0;
     end
     q(2)=(v02-x(2)-discharge(2))/t+lize_month(1);
     if q(2)<0
         q(2)=0;
     end
     q(3)=(v03-x(3)-discharge(3))/t+q(1)+discharge(1)/t+q(2)+discharge(2)/t+luoduxi_month(1);
     if q(3)<0
         q(3)=0;
     end
     q(4)=(v04-x(4)-discharge(4))/t+q(3)+discharge(3)/t;
     if q(4)<0
         q(4)=0;
     end
     %计算2到12月
     for j=5:4:48
         q(j)=(x(j-4)-x(j)-discharge(j))/t+weituo_month((j-1)/4+1);
         if q(j)<0
             q(j)=0;                             % 渭沱发电引用流量
         end
         q(j+1)=(x(j-3)-x(j+1)-discharge(j+1))/t+lize_month((j-1)/4+1);
         if q(j+1)<0
             q(j+1)=0;                           % 利泽发电引用流量
         end
         q(j+2)=(x(j-2)-x(j+2)-discharge(j+2))/t+q(j+1)+discharge(j+1)/t+...
             q(j)+discharge(j)/t+luoduxi_month((j-1)/4+1);
         if q(j+2)<0
             q(j+2)=0;                           % 草街发电引用流量
         end
         q(j+3)=(x(j-1)-x(j+3)-discharge(j+3))/t+q(j+2)+discharge(j+2)/t;
         if q(j+3)<0
             q(j+3)=0;                           % 井口发电引用流量
         end
     end
     
      %%%%%%%%%%%%%%%%%%%%%%%%%%% 水位差计算
      for j=1:4:48
          h(j)=z(j)-z(j+2);                    % 渭沱草街水位差
          h(j+1)=z(j+1)-z(j+2);                % 利泽草街水位差
          h(j+2)=z(j+2)-z(j+3);                % 草街井口水位差
          h(j+3)=z(j+3)-169;                   % 井口嘉陵江水位差
      end
      %%%%%%%%%%%%%%%%%%%%%%%%%%%  水轮机水头计算
      for j=1:4:48
          H(j)  =h(j)  -(2.5e-5)*(q(j)/2)^2;
          H(j+1)=h(j+1)-(1.652967e-5)*(q(j+1)/4)^2;
          H(j+2)=h(j+2)-(1.12889e-5)*(q(j+2)/4)^2;
          H(j+3)=h(j+3)-(1.736e-5)*(q(j+3)/6)^2;
      end
      %%%%%%%%%%%%%%%%%%%%%%% 发电量计算，取效率为=9.0
      for j=1:4:48                    % 出力系数取为8.8263，可以改进，求每个月出力值 
            Em((j-1)/4+1)=1003*(8.8263*H(j)*q(j)+8.8263*H(j+1)*q(j+1)+...
                8.8263*H(j+2)*q(j+2)+8.8263*H(j+3)*q(j+3))*t;
            Es(j)  =1003*8.8263*H(j)*q(j)*t;
            Es(j+1)=1003*8.8263*H(j+1)*q(j+1)*t;
            Es(j+2)=1003*8.8263*H(j+2)*q(j+2)*t;
            Es(j+3)=1003*8.8263*H(j+3)*q(j+3)*t;
      end
     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%梯级电站的总体年发电量
      result=0;
      for j=1:12
          result=result+Em(j);  % 月电量累计求和
      end
      %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 电量从焦耳换算成千瓦时
      result=result/3600000;
      %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
      %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%罚函数计算
      G1=zeros(size(x));
      G2=zeros(size(x));
      for i=1:4:48   % 水轮机水头上界约束
          G1(i)=  max([H(i)-3.4,0]);
          G1(i+1)=max([H(i+1)-8.8,0]);
          G1(i+2)=max([H(i+2)-26.7,0]);
          G1(i+3)=max([H(i+3)-8.04,0]);
      end
      
      for i=1:4:48   % 水轮机水头下界约束
          G2(i)=  max([-H(i)+2,0]);
          G2(i+1)=max([-H(i+1)+6.8,0]);
          G2(i+2)=max([-H(i+2)+20,0]);
          G2(i+3)=max([-H(i+3)+4.16,0]);
      end
     G=[G1 G2];
     n=length(find(G~=0));  % 违反约束的个数
     violent=r*sum(G);    %输出违反约束的程度与个数   
     % 库水位的约束在主函数中通过设置粒子边界来实现